# 3.1
# Умножение на 12. Используйте 4 сложения.

def mul12(a):
    a2 = a+a
    a4 = a2+a2
    a8 = a4+a4
    return a8+a4


# 3.2
# Умножение на 12. Используйте 4 сложения.

def mul12(a):
    a2 = a+a
    a4 = a2+a2
    a8 = a4+a4
    return a8+a8


# 3.3
# Умножение на 15. Используйте 4 сложения.

def mul12(a):
    a2 = a+a
    a4 = a2+a2
    a8 = a4+a4
    a7 = a-a8
    return a8-a7


# 3.3
# Умножение на 12. Используйте 4 сложения.
def mul12(a):
    a2 = a+a
    a4 = a2+a2
    a8 = a4+a4
    a7 = a-a8
    return a8-a7
